[
    {
        "headline": "Mercenary boss calls for Romania to ‘boil over’ after far-right front-runner blocked from race",
        "author": "No author found",
        "body": "News Politics Mercenary boss calls for Romania to ‘boil over’ after far-right front-runner blocked from raceHoraţiu Potra called the election bureau’s decision to block Călin Georgescu’s presidential bid a “globalist coup.” ShareShare optionsCopy LinkEMailTwitterWhatsAppLinkedinShortly after Sunday's announcement, scores of Călin Georgescu's supporters clashed with riot police in downtown Bucharest, throwing rocks, firecrackers and bottles, and injuring some police officers who responded to the unrest with tear gas. | Daniel Mihailescu/AFP via Getty ImagesMarch 10, 20254:29 pm CETBy Csongor KörömiMercenary Horaţiu Potra called for soldiers and citizens to take up arms after far-right election front-runner Călin Georgescu was barred from competing in the May rerun of Romania’s presidential election, local media reported.According to messages obtained by Romanian news channel Digi24, Potra sent voice memos to a WhatsApp group of his supporters on Sunday night calling for armed action by the military, explicitly urging soldiers to come out with weapons and arrest “those who carried out a coup.”“Call your colleagues and friends and go to the fight, boys!” Potra said. “If we are not able to do something, who will? Go to your towns, go to Bucharest, with your scythes, pitchforks and axes.” He added that “the globalists’ coup continues” and “now all of Romania must boil over.”AdvertisementAdvertisementPotra was referring to a decision by Romania’s Central Election Bureau on Sunday to block Georgescu from running for the presidency in May.The bureau said Georgescu had violated Romania’s election rules while coming out of nowhere to win the first round of the presidential vote last November, partly on the back of a wildly successful TikTok campaign. The Constitutional Court later annulled his victory, flagging undeclared campaign financing and fraudulent use of digital technologies, with an alleged Russian operation seen as having influenced the result.Georgescu has appealed the bureau’s decision.Shortly after Sunday’s announcement, scores of Georgescu supporters clashed with riot police in downtown Bucharest, throwing rocks, firecrackers and bottles, and injuring some police officers who responded to the unrest with tear gas. Tech billionaire Elon Musk and other allies of United States President Donald Trump have joined in the chorus, slamming Georgescu’s barring as undemocratic and “crazy.”Potra, a figure in local Romanian politics and the former leader of a mercenary group that operated in Africa, was detained on weapons and public incitement charges in December after allegedly planning a Jan. 6-style plot in the country after the initial presidential election was annulled. AdvertisementAdvertisementRelated TagsCourt decisionsCourtsDemocracyElectionsElections in EuropeForeign policyKremlinMilitaryRomanian elections 2024Romanian politicsServicesWeaponsRelated CountriesRomaniaRussiaRelated PeopleCălin GeorgescuOur readers read nextPutin boots out more British diplomats in spying row5 HRS ago 2 mins readTrump and Putin gang up on European centrists in Romania’s election crisis7 HRS ago 5 mins readGreenland heads to the polls amid Trump’s threats to take over12 HRS ago 4 mins readFar-right front-runner Călin Georgescu blocked from Romanian presidential race20 HRS ago 3 mins readMore from Csongor KörömiIsrael to cut electricity in Gaza immediately, energy minister says“We will use all the means at our disposal to ensure that all the hostages return,” Eli Cohen said.21 HRS ago 2 mins readFrance to use interest from frozen Russian assets to finance arms for UkraineReply from Moscow: “You will still have to … return what was stolen.”22 HRS ago 2 mins readPoland ready to seek Starlink alternatives for Ukraine if Musk proves ‘unreliable’Musk responds: “There is no substitute for Starlink.”23 HRS ago 3 mins readUkraine ‘committed’ to dialogue with US, Zelenskyy says ahead of Saudi talks“The key is to move quickly and effectively,” Ukraine’s president said.Mar 92 mins read",
        "url": "https://www.politico.eu/article/mercenary-horatiu-potra-romania-election-calin-georgescu-blocked/"
    },
    {
        "headline": "Far-right front-runner Călin Georgescu blocked from Romanian presidential race",
        "author": "No author found",
        "body": "News Politics Far-right front-runner Călin Georgescu blocked from Romanian presidential raceU.S. Trump administration has been pressing Romanian officials to allow him to stand in May’s vote. ShareShare optionsCopy LinkEMailTwitterWhatsAppLinkedinCalin Georgescu came out of nowhere to win the first round of the presidential vote last November, partly on the back of a wildly successfully TikTok campaign. | Andrei Pungovschi/Getty ImagesMarch 9, 20258:04 pm CETBy Carmen PaunRomania’s Central Electoral Bureau on Sunday blocked Russia-aligned, far-right candidate Călin Georgescu from competing in a May rerun of the country’s presidential election.The bureau said Georgescu had violated Romania’s election rules while coming out of nowhere to win the first round of the presidential vote last November, partly on the back of a wildly successful TikTok campaign. The Constitutional Court later annulled his victory, flagging undeclared campaign financing and fraudulent use of digital technologies, with an alleged Russian operation seen as having influenced the result.The Digi24 news service said the electoral bureau had voted against allowing Georgescu, again leading the polls ahead of the rerun, to proceed by a margin of 10 to 4. Georgescu has appealed the decision, with the Constitutional Court obliged to rule by Wednesday.AdvertisementAdvertisementScores of Georgescu supporters clashed with riot police in downtown Bucharest Sunday night. They threw rocks, firecrackers and bottles, injuring some law enforcement officers responding to the unrest, Digi24 reported. Riot police used tear gas in response.Elena Lasconi, president of the center-right Union Save Romania party, who had been due to face Georgescu in the runoff last year before the election was canceled, called on the bureau to explain its decision quickly: “Decisions must be explained, otherwise people will become furious, suspicious and prone to conspiracies,” she said in a statement.‘This is crazy’The Trump administration, itself aligning with the Kremlin on core foreign policy objectives, has supported the idea of allowing Georgescu to compete.Trump’s senior adviser Elon Musk reacted immediately to Sunday’s news from Romania with a post on X saying: “This is crazy.”Romania’s Central Electoral Bureau blocked Russia-aligned, far-right candidate Călin Georgescu from running in May’s presidential election. | Daniel Mihailescu/Getty ImagesMatteo Salvini, Italy’s deputy prime minister and leader of the right-wing populist party Lega, called the rejection of Georgescu’s candidacy a “Soviet-style Euro-coup” in a post on X. “Lega is close to so many Romanian citizens who, at home or in Italy, are robbed of their right to vote by a very grave theft of democracy,” he wrote.Georgescu also tried to play up what he claimed were the international implications of the election bureau’s decision: “If democracy in Romania falls, the entire democratic world will fall!” he wrote on X. “This is just the beginning. It’s that simple! Europe is now a dictatorship, Romania is under tyranny!”This article has been updated to note Georgescu appealed the decision.AdvertisementAdvertisementRelated TagsDemocracyElectionsElections in EuropeForeign policyKremlinLobbyingMediaServicesRelated CountriesRomaniaRussiaUnited StatesRelated PeopleCălin GeorgescuDonald TrumpElon MuskOur readers read nextPutin boots out more British diplomats in spying row5 HRS ago 2 mins readGreenland heads to the polls amid Trump’s threats to take over12 HRS ago 4 mins readUS hostage envoy doubles down on Trump’s Hamas threat21 HRS ago 3 mins readFrance to use interest from frozen Russian assets to finance arms for Ukraine22 HRS ago 2 mins readMore from Carmen PaunRomanian police haul in election front-runner Călin Georgescu for questioningThe pro-Russia candidate was quizzed over the financing of his controversial — and successful — election campaign late last year.Feb 264 mins readUSAID to place most personnel on leave, lay off at least 1,600A federal judge cleared the move Friday after a two-week hold.Feb 244 mins readTrump’s beef with the World Health Organization is personalHe’s said the UN body’s head, Tedros Adhanom Ghebreyesus, treated China better than him during the pandemic.Jan 2912 mins read‘It will kill people’: Chaos, confusion after Trump halts US foreign aidThe new directive puts some aid organizations at risk of bankruptcy.Jan 278 mins read",
        "url": "https://www.politico.eu/article/far-right-frontrunner-calin-georgescu-blocked-from-romanian-presidential-race/"
    },
    {
        "headline": "Ukraine ‘committed’ to dialogue with US, Zelenskyy says ahead of Saudi talks",
        "author": "No author found",
        "body": "News Defense Ukraine ‘committed’ to dialogue with US, Zelenskyy says ahead of Saudi talks“The key is to move quickly and effectively,” Ukraine’s president said.ShareShare optionsCopy LinkEMailTwitterWhatsAppLinkedinPresident Zelenskyy said he will visit Saudi Arabia's Crown Prince Mohammed bin Salman on Mar. 10, but plans to send delegates to the meeting with the U.S. team on Mar. 11. | Nicolas Tucat/AFP via Getty ImagesMarch 9, 20253:13 pm CETBy Csongor KörömiUkraine is \"fully committed\" to further dialogue with U.S. representatives on ways to end the war with Russia, Ukrainian President Volodymyr Zelenskyy said as he named a high-level delegation to attend a U.S.-Ukraine meeting in Saudi Arabia  this week.After a spat between Zelenskyy, U.S. President Donald Trump and U.S. Vice President JD Vance at the White House on Feb. 28, Washington announced it was suspending military aid and intelligence sharing to Ukraine, which was followed by an increase in Russian aggression in recent days. Zelenskyy condemned the \"brutal\" deadly attacks on eastern Ukraine, saying they prove that Russia, unlike Ukraine, is \"not thinking about how to end the war.\"AdvertisementAdvertisement\"Ukraine has been seeking peace from the very first second of this war. Realistic proposals are on the table. The key is to move quickly and effectively,\" Zelenskyy wrote on X.The delegation Zelenskyy announced for the talks in Saudi Arabia is made up of diplomatic and military representatives, including his chief of staff, Andriy Yermak, Foreign Minister Andriy Sybiha and Defense Minister Rustem Umerov. The delegation is set to meet with U.S. negotiators, including Secretary of State Marco Rubio, on Tuesday in a bid to repair ties with the Trump administration.Zelenskyy said he will visit Saudi Arabia's Crown Prince Mohammed bin Salman on Monday, but won't stay for the meeting with the U.S. team on Tuesday.\"On our side, we are fully committed to constructive dialogue, and we hope to discuss and agree on the necessary decisions and steps,\" he said in a post on X on Saturday.Related TagsDefenseDiplomacyMilitaryWarWar in UkraineRelated CountriesRussiaSaudi ArabiaUkraineUnited StatesRelated PeopleDonald TrumpMohammed bin SalmanVladimir PutinVolodymyr ZelenskyyOur readers read nextSPONSORED CONTENT FROM SÍ A ALMARAZ, SÍ AL FUTUROThe EU and its sovereignty: Almaraz power plant is a turning point2 HRS ago 6 mins readUS dominates European weapons purchases: report5 HRS ago 2 mins readEU-US rift triggers call for made-in-Europe tech11 HRS ago 5 mins readECB resistance wavers as pressure mounts to seize Russian assets11 HRS ago 6 mins readMore from Csongor KörömiIsrael to cut electricity in Gaza immediately, energy minister says“We will use all the means at our disposal to ensure that all the hostages return,” Eli Cohen said.21 HRS ago 2 mins readFrance to use interest from frozen Russian assets to finance arms for UkraineReply from Moscow: “You will still have to … return what was stolen.”22 HRS ago 2 mins readPoland ready to seek Starlink alternatives for Ukraine if Musk proves ‘unreliable’Musk responds: “There is no substitute for Starlink.”23 HRS ago 3 mins readFarage says row over Reform MP has ‘dented’ party’s sense of unityMP Rupert Lowe openly criticized the party leader, followed by allegations against him that led to his suspension.Mar 92 mins read",
        "url": "https://www.politico.eu/article/zelenskyy-committed-to-dialogue-with-us-on-ending-ukraine-war/"
    },
    {
        "headline": "Clashes in Syria kill more than 1,000 people in 2 days",
        "author": "No author found",
        "body": "News Clashes in Syria kill more than 1,000 people in 2 daysThe country’s post-Assad leadership calls for national unity as violence escalates.ShareShare optionsCopy LinkEMailTwitterWhatsAppLinkedinAbout 745 civilians were killed on Friday and Saturday in ongoing violence along Syria's coast, along with 125 members of government security forces and 148 fighters from armed groups. | Asad al Asad/Middle East Images/AFP via Getty ImagesMarch 9, 202511:57 am CETBy Csongor KörömiMore than 1,000 people have died in two days of clashes and revenge killings in Syria as the country’s security forces allegedly killed hundreds of civilians belonging to the Alawite religious minority, a war monitoring group said. The Syrian Observatory for Human Rights said about 745 civilians were killed on Friday and Saturday in ongoing violence along the country’s coast, along with 125 members of government security forces and 148 fighters from armed groups linked to ousted Syrian leader Bashar Assad.Syrian President Ahmad al-Sharaa called for national unity on Sunday, saying the country “has the characteristics for survival” and that what is happening in Syria now is “within the expected challenges.”AdvertisementAdvertisement“We must preserve national unity and internal peace, we can live together,” Sharaa said in a video quoted by Reuters, speaking at a mosque in his childhood neighborhood of Mazzah in Damascus.The clashes erupted on Thursday and marked a major escalation in the challenge to the new government led by Sharaa’s movement Hayat Tahrir al-Sham, or HTS, three months after the insurgents took over following the removal of Assad from power.Assad was ousted last December after decades of dynastic rule by his family, marked by severe repression and a devastating civil war. Alawites, however, had been a large part of Assad’s support base for decades.Authorities blamed the Alawite-targeted summary executions and deadly raids on unruly armed militias who came to help security forces and have long blamed Assad’s supporters for past crimes.Clashes continued overnight in several towns, and a security official told Reuters that pro-Assad insurgents were now escalating their campaign, staging hit-and-run attacks on several public utilities in the past 24 hours.Related TagsMiddle EastWarWar in SyriaRelated CountriesSyriaRelated PeopleBashar AssadOur readers read nextEU-US rift triggers call for made-in-Europe tech11 HRS ago 5 mins readUnpackedTrump says Ukraine doesn’t hold any cards — he’s the one snatching them12 HRS ago 6 mins readUS hostage envoy doubles down on Trump’s Hamas threat21 HRS ago 3 mins readIsrael to cut electricity in Gaza immediately, energy minister says21 HRS ago 2 mins readMore from Csongor KörömiIsrael to cut electricity in Gaza immediately, energy minister says“We will use all the means at our disposal to ensure that all the hostages return,” Eli Cohen said.21 HRS ago 2 mins readFrance to use interest from frozen Russian assets to finance arms for UkraineReply from Moscow: “You will still have to … return what was stolen.”22 HRS ago 2 mins readPoland ready to seek Starlink alternatives for Ukraine if Musk proves ‘unreliable’Musk responds: “There is no substitute for Starlink.”23 HRS ago 3 mins readUkraine ‘committed’ to dialogue with US, Zelenskyy says ahead of Saudi talks“The key is to move quickly and effectively,” Ukraine’s president said.Mar 92 mins read",
        "url": "https://www.politico.eu/article/clashes-in-syria-kill-more-than-1000-people-in-two-days/"
    },
    {
        "headline": "Revealed: NATO downplays climate and gender language to appease Trump",
        "author": "No author found",
        "body": "News Defense Revealed: NATO downplays climate and gender language to appease TrumpThe U.S. president has gone on the warpath against DEI and the alliance is falling into line, according to three people familiar with the matter.ShareShare optionsCopy LinkEMailTwitterWhatsAppLinkedinFree article usually reserved for subscribersNATO has climate advisers who mostly advise military staff on environmental challenges during war. | Omar Havana/Getty ImagesApril 17, 20252:36 pm CETBy Antoaneta RoussiBRUSSELS — NATO staff are watering down language around climate, gender and diversity as a precaution to avoid retaliation by the Trump administration, according to three people familiar with the matter.Phrases dealing with climate, women and security have been rephrased in new NATO legislation drafted by its committees and working groups with language thought to be more acceptable to the U.S. as the alliance faces an uncertain future during Donald Trump's second term in the White House.The new administration has gone on the warpath against diversity, equity and inclusion (DEI) efforts, trying to block funding for universities and stripping federal programs that incorporate the measures. It is also purging the Pentagon to eradicate all vestiges of such programs.AdvertisementAdvertisement“Everyone sees on the news where the Trump admin stands; you don’t want to do anything that shoots yourself in the foot,\" one official said.\"Green technologies” have allegedly been replaced with “innovative technologies,” while “climate” has been labeled an “operational environment,” another NATO official said. The officials were granted anonymity to discuss sensitive issues.Meanwhile, any language around \"gender\" or \"women, peace and security\" is being avoided by officials who want to get things passed by all 32 member countries, including the U.S.NATO has climate advisers who mostly advise military staff on environmental challenges during times of war, such as extreme temperatures that may affect personnel capacity or impact equipment. | Toms Kalnins/EPA-EFE“Everyone knows that the worst thing you can do is present it as a diversity issue,” said one of the officials. “It’s not a woke agenda, it's part of a military agenda, and now more people are pricking up their ears to make sure it is spoken about in military terms.”NATO has climate advisers who mostly advise military staff on environmental challenges during times of war, such as extreme temperatures that may affect personnel capacity or impact equipment. So far they've been left unscathed.Trump has announced that Europe needs to end its “freeloading” on the U.S. and start paying more for defense. He has also pushed to increase the alliance's defense spending target to 5 percent of GDP from the current goal of at least 2 percent — but at the same time has undermined the alliance's common defense provisions by threatening to abandon allies he thinks aren't spending enough on their militaries.On Tuesday the administration proposed cutting funding to the State Department by 48 percent, which would affect funding for NATO's internal budget, the United Nations and 20 other international organizations.AdvertisementAdvertisementRelated TagsClimate changeClimate diplomacyDefense budgetsDepartmentEnvironmentGender equalityMilitaryNATOSecurityWarRelated CountriesUnited StatesRelated PeopleDonald TrumpRelated OrganizationsNATOUnited NationsOur readers read nextObituaryThe complex legacy of Pope Francis3 HRS ago 7 mins readFormer Pentagon official warns department’s dysfunction could topple Hegseth9 HRS ago 4 mins readFrom Across the PondTrump may get a nuclear deal — on Iran’s terms10 HRS ago 6 mins readIsraeli military says review into its killing of Gaza aid workers found ‘professional failures’20 HRS ago 2 mins readMore from Antoaneta RoussiUkraine allies hold talks to secure a non-existent peaceThe coalition of the willing will start laying out potential contributions in writing.Apr 103 mins readRutte smiles and Rubio flees as NATO survives a summitNATO’s boss insisted that the alliance “remains the cornerstone of European security,” despite worries about Trump.Apr 44 mins readUK regrets ‘return to protectionism’ as Trump’s tariffs spark trade warForeign Secretary David Lammy says Britain “believes in open trade” — and refuses to rule out retaliatory tariffs.  Apr 42 mins readCanada to Europe: US relationship will ‘never be the same again’ after Trump’s trade warOttawa’s Foreign Minister Mélanie Joly says tariffs would ultimately be a tax on the American people.Apr 42 mins read",
        "url": "https://www.politico.eu/article/nato-downplays-climate-and-gender-language-to-appease-trump/"
    }
]